In [1]:
import pandas as pd
import numpy as np
import timeit

def print_series(sr: pd.Series):
    print(sr.to_string(max_rows=10, dtype=True))
    print()

def test_solutions(solution_1, solution_2):
    # Test performance with timeit
    time_1 = timeit.timeit(solution_1, number=100)
    time_2 = timeit.timeit(solution_2, number=100)

    print(f"Solution 1 Time: {time_1:.6f} seconds")
    print(f"Solution 2 Time: {time_2:.6f} seconds")

exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

##### 1. Write a Pandas program to create a dataframe from a dictionary and display it.

In [4]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

##### 2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [3]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [69]:

print('Summary of the basic information about this DataFrame and its data:')
print(df.info())
print()
print(df)

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 4. Write a Pandas program to get the first 3 rows of a given DataFrame.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [66]:
df
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

##### 5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [67]:
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [68]:
df.loc[:,['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

##### 6. Write a Pandas program to select the specified columns and rows from a given data frame.
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [28]:


print(df.iloc[[1,3,5,6], [0,1]])

print()
print(df.iloc[[1,3,5,6]][['name','score']])

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

##### 7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [31]:


print("Number of attempts in the examination is greater than 2:")
df[df['attempts'] > 2]

Number of attempts in the examination is greater than 2:

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

##### 8. Write a Pandas program to count the number of rows and columns of a DataFrame.
<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [34]:

print(f'Number of Rows: {df.shape[0]}')
print(f'Number of Columns: {df.shape[1]}')

Number of Rows: 10
Number of Columns: 4

In [36]:

print(f'Number of Rows: {len(df.axes[0])}')
print(f'Number of Columns: {len(df.axes[1])}')

Number of Rows: 10
Number of Columns: 4

In [41]:
def solution_1():
    return df.shape[0], df.shape[1]

def solution_2():
    return len(df.axes[0]), len(df.axes[1])

test_solutions(solution_1, solution_2)

Solution 1 Time: 0.000320 seconds
Solution 2 Time: 0.000260 seconds

##### 9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [52]:
df[df['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

##### 10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [55]:
df[df['score'].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

##### 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [57]:

df[(df.attempts < 2) & (df.score > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

##### 12. Write a Pandas program to change the score in row 'd' to 11.5.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [62]:
print(df)

df.loc['d', 'score'] = 11.5

print()
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 13. Write a Pandas program to calculate the sum of the examination attempts by the students.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [72]:
print(df)
print('Sum of the examination attempts by the students:')
print(df.attempts.sum())

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
Sum of the examination attempts by the students:
19

##### 14. Write a Pandas program to calculate the mean of all students' scores. Data is stored in a dataframe.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [74]:
print('Mean score for each different student in data frame:')
print(df.score.mean())

Mean score for each different student in data frame:
13.5625

##### 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

    Values for each column will be: 
    name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"
</details>

In [79]:
df.loc['k'] = {'name': "Suresh", 'score': 15.5, 'attempts': 1, 'qualify': 'yes'}

print('Print all records after insert a new record:')
print(df)
print()

df.drop('k', inplace=True)

print('Delete the new row and display the original  rows:')
print(df)

Print all records after insert a new record:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

Delete the new row and display the original  rows:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [89]:
print(df)
# I changed sorting condition: attemps=asc, score=desc
print()
df.sort_values(['attempts', 'score'], ascending=[True, False])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
j      Jonas   19.0         1     yes
g    Matthew   14.5         1     yes
a  Anastasia   12.5         1     yes
h      Laura    NaN         1      no
c  Katherine   16.5         2     yes
e      Emily    9.0         2      no
i      Kevin    8.0         2      no
f    Michael   20.0         3     yes
b       Dima    9.0         3      no
d      James    NaN         3      no

##### 17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [3]:
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

##### 18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [25]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

print(df)
print()

df.replace(to_replace={'name': 'James'}, value={'name': 'Suresh'}, inplace=True)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [24]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

print(df)
print()

df['name'] = df['name'].replace('James', 'Suresh')
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [16]:
def init_df():
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    return pd.DataFrame(exam_data, index=labels)

def solution_1():
    df.replace(to_replace={'name': 'James'}, value={'name': 'Suresh'}, inplace=True)
    return df

def solution_2():
    df['name'] = df['name'].replace('James', 'Suresh')
    return df

df = init_df()
test_solutions(solution_1, lambda: None)

df = init_df()
test_solutions(lambda: None, solution_2)

Solution 1 Time: 0.043340 seconds
Solution 2 Time: 0.000010 seconds
Solution 1 Time: 0.000011 seconds
Solution 2 Time: 0.023335 seconds

##### 19. Write a Pandas program to delete the 'attempts' column from the DataFrame.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [30]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

df.drop('attempts', axis=1)

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

In [32]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

df.pop('attempts')
df

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

##### 20. Write a Pandas program to insert a new column in existing DataFrame.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [41]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

color = ['Red', 'Blue', 'Yellow', 'Green', 'Red', 'Blue', 'Yellow', 'Green', 'Red', 'Blue']
df['color'] = color
df

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Yellow
d      James    NaN         3      no   Green
e      Emily    9.0         2      no     Red
f    Michael   20.0         3     yes    Blue
g    Matthew   14.5         1     yes  Yellow
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no     Red
j      Jonas   19.0         1     yes    Blue

##### 21. Write a Pandas program to iterate over rows in a DataFrame.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = [
        {'name':'Anastasia', 'score':12.5}, 
        {'name':'Dima','score':9}, 
        {'name':'Katherine','score':16.5}
    ]
</details>

In [49]:
exam_data = [
    {'name':'Anastasia', 'score':12.5}, 
    {'name':'Dima','score':9}, 
    {'name':'Katherine','score':16.5}
]
df = pd.DataFrame(exam_data)
for index, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

##### 22. Write a Pandas program to get list from DataFrame column headers.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [53]:
print(df.axes[1].to_list())

print(df.columns.to_list())

['name', 'score', 'attempts', 'qualify']
['name', 'score', 'attempts', 'qualify']

##### 23. Write a Pandas program to rename columns of a given DataFrame

In [66]:
df = pd.DataFrame(np.arange(1, 10).reshape(3,3).T, columns=['col1', 'col2', 'col3'])
print('Original DataFrame:')
print(df)
print()

print('New DataFrame after renaming columns:')
df = df.rename(columns={'col1': 'column1', 'col2': 'column2', 'col3': 'column3'})
print(df)

Original DataFrame:
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

New DataFrame after renaming columns:
   column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9

In [67]:
df = pd.DataFrame(np.arange(1, 10).reshape(3,3).T, columns=['col1', 'col2', 'col3'])
print('Original DataFrame:')
print(df)
print()

print('New DataFrame after renaming columns:')
df.columns = ['column1', 'column2',  'column3']
print(df)

Original DataFrame:
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

New DataFrame after renaming columns:
   column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9

##### 24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.

<details>
    <summary>Sample Python dictionary data and list labels:</summary>
    
    exam_data = {
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
</details>

In [74]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
df[df['col1'] == 4]

   col1  col2  col3
1     4     5     8
3     4     7     0

##### 25. Write a Pandas program to change the order of a DataFrame columns.

In [81]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

df = df[['col3', 'col2', 'col1']]
print(df)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

##### 26. Write a Pandas program to add one row in an existing DataFrame.

In [114]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

new_row = pd.DataFrame({'col1': 11, 'col2': 12, 'col3': 13}, index=[0])
print(
    pd.concat([df, new_row], ignore_index=True)
)
print()

print(
    pd.concat([df, new_row]).reset_index(drop=True)
)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    11    12    13

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    11    12    13

##### 27. Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [118]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

df.to_csv('new_file.csv', sep='\t')

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

##### 28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

In [42]:
df = pd.DataFrame(
    {
        'city': ['California', 'Georgia', 'Los Angeles', 'California', 'Georgia', 'Los Angeles'], 
        'name of person': ['James Bond', 'Clark Kent', 'Will Smith', 'Pavel Durov', 'Kris Taker', 'Jecky Chan']
    }
)
result = df.groupby(['city']).count().reset_index()
result.columns = ['city', 'Number of people']
print(result)
print()

result = df.groupby(['city']).size().reset_index(name='Number of people')
print(result)

          city  Number of people
0   California                 2
1      Georgia                 2
2  Los Angeles                 2

          city  Number of people
0   California                 2
1      Georgia                 2
2  Los Angeles                 2

##### 29. Write a Pandas program to delete DataFrame row(s) based on given column value.

In [49]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

result = df.drop(df[df.col2 == 5].index)
print(result)
print()

result = df[df.col2 != 5]
print(result)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

##### 30. Write a Pandas program to widen output display to see more columns.

In [56]:
pd.reset_option('display.max_columns')

# Create a DataFrame with many columns
df = pd.DataFrame(np.random.randn(5, 25), columns=list('ABCDEFGHIJKLMNO1234567890'))

# Before widening display
print(f"Default display ({pd.get_option('display.max_columns')}):")
print(df)

# Widening the output display to show more columns
pd.set_option('display.max_columns', 30)

# After widening display
print(f"\nWidened display ({pd.get_option('display.max_columns')}):")
print(df)

Default display (20):
          A         B         C         D         E         F         G  \
0 -0.227594 -0.995596  0.572723 -0.403725 -0.198299 -1.238163  1.354895
1 -1.023537 -1.123615 -0.106022 -0.060359  1.829575 -0.523717 -0.654394
2  1.607041 -0.407905 -0.475144 -0.295690 -1.111492 -0.013987  1.003308
3  1.014718 -1.152398  0.813481  0.194807  0.307056  0.383114  1.018581
4  0.072559 -0.173930  1.325392  1.181080 -0.657554  0.042751 -1.445312

          H         I         J  ...         1         2         3         4  \
0 -0.331086 -0.641801  0.778678  ...  1.205402 -0.667057 -0.394523  0.148896
1 -0.494721  0.273688  0.860323  ...  1.141569 -1.360213  0.709737  1.002143
2  1.581396 -1.551646  0.138451  ... -0.922349 -0.527235 -0.306611 -0.868489
3  0.315615 -1.763286  2.038996  ...  1.010180 -0.341562  1.047633 -0.725732
4  1.115487  0.756396 -1.090028  ...  1.062749  0.097891 -0.381547 -1.983072

          5         6         7         8         9         0
0 -0.096163  1.388812 -0.190593  0.001026 -1.045562  0.052095
1 -0.654699 -0.571101 -0.482318 -0.566659  0.567483  0.317050
2 -0.620974 -0.880456  0.562249 -0.138686 -0.050950  1.029581
3 -0.616696 -0.078086  0.144732  0.824096 -0.176869  0.515345
4  0.200891 -1.400542  0.242730  1.041179 -0.231994 -0.277604

[5 rows x 25 columns]

Widened display (30):
          A         B         C         D         E         F         G  \
0 -0.227594 -0.995596  0.572723 -0.403725 -0.198299 -1.238163  1.354895
1 -1.023537 -1.123615 -0.106022 -0.060359  1.829575 -0.523717 -0.654394
2  1.607041 -0.407905 -0.475144 -0.295690 -1.111492 -0.013987  1.003308
3  1.014718 -1.152398  0.813481  0.194807  0.307056  0.383114  1.018581
4  0.072559 -0.173930  1.325392  1.181080 -0.657554  0.042751 -1.445312

          H         I         J         K         L         M         N  \
0 -0.331086 -0.641801  0.778678 -1.198140 -0.881473  1.509162  0.512177
1 -0.494721  0.273688  0.860323  0.027945  0.552312  1.017799  0.163936
2  1.581396 -1.551646  0.138451 -0.286662 -1.791543 -0.643299  1.894962
3  0.315615 -1.763286  2.038996  0.284977 -2.046657 -0.098984  1.378277
4  1.115487  0.756396 -1.090028  0.532063  0.525229  0.036012  1.066436

          O         1         2         3         4         5         6  \
0  0.523851  1.205402 -0.667057 -0.394523  0.148896 -0.096163  1.388812
1 -0.273879  1.141569 -1.360213  0.709737  1.002143 -0.654699 -0.571101
2  1.556882 -0.922349 -0.527235 -0.306611 -0.868489 -0.620974 -0.880456
3  0.404805  1.010180 -0.341562  1.047633 -0.725732 -0.616696 -0.078086
4  0.126804  1.062749  0.097891 -0.381547 -1.983072  0.200891 -1.400542

          7         8         9         0
0 -0.190593  0.001026 -1.045562  0.052095
1 -0.482318 -0.566659  0.567483  0.317050
2  0.562249 -0.138686 -0.050950  1.029581
3  0.144732  0.824096 -0.176869  0.515345
4  0.242730  1.041179 -0.231994 -0.277604

##### 31. Write a Pandas program to select a row of series/dataframe by given integer index.

In [65]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

print(df.iloc[[2]])

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col1  col2  col3
2     3     6     9

##### 32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [67]:
df.fillna(0)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    0.0         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    0.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 33. Write a Pandas program to convert index in a column of the given dataframe.

In [173]:
print(df.reset_index(level=0).to_string(index=False))
print()

df.reset_index().style.hide(axis="index")

 index          0
     0 2000-03-11
     1 2000-03-12
     2 2000-03-13

##### 34. Write a Pandas program to set a given value for particular cell in  DataFrame using index value.

In [89]:
df.loc[['b'], ['score']] = 11
print(df)

df.at['i', 'score'] = 10.2
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima   11.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima   11.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin   10.2         2      no
j      Jonas   19.0         1     yes

##### 35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.

In [98]:
print('Number of NaN values in one or more columns:')
print(df.isna().sum().sum())

print(df.isna().values.sum())

Number of NaN values in one or more columns:
3
3

In [100]:
def solution_1():
    return df.isna().sum().sum()

def solution_2():
    df.isna().values.sum()

test_solutions(solution_1, solution_2)

Solution 1 Time: 0.036578 seconds
Solution 2 Time: 0.011374 seconds

##### 36. Write a Pandas program to drop a list of rows from a specified DataFrame.

In [117]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

print(df.drop([2, 4]))

print(df.drop(df.index[[2,4]]))

print(df.index[[2,4]])

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0
   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0
Index([2, 4], dtype='int64')

In [116]:
def solution_1():
    return df.drop([2, 4])

def solution_2():
    return df.drop(df.index[[2,4]])
    
test_solutions(solution_1, solution_2)

Solution 1 Time: 0.037416 seconds
Solution 2 Time: 0.049218 seconds
Solution 1 Time: 0.038590 seconds
Solution 2 Time: 0.030213 seconds
Solution 1 Time: 0.036242 seconds
Solution 2 Time: 0.031603 seconds
Solution 1 Time: 0.032255 seconds
Solution 2 Time: 0.030612 seconds
Solution 1 Time: 0.035678 seconds
Solution 2 Time: 0.032367 seconds
Solution 1 Time: 0.039254 seconds
Solution 2 Time: 0.030754 seconds
Solution 1 Time: 0.032750 seconds
Solution 2 Time: 0.031279 seconds
Solution 1 Time: 0.032841 seconds
Solution 2 Time: 0.030938 seconds
Solution 1 Time: 0.035197 seconds
Solution 2 Time: 0.032056 seconds

##### 37. Write a Pandas program to reset index in a given DataFrame.

In [124]:
result = df.drop(df.index[[0, 1]]).reset_index()
print(result)

  index       name  score  attempts qualify
0     c  Katherine   16.5       2.0     yes
1     d      James    NaN       NaN      no
2     e      Emily    9.0       2.0      no
3     f    Michael   20.0       3.0     yes
4     g    Matthew   14.5       1.0     yes
5     h      Laura    NaN       1.0      no
6     i      Kevin    8.0       2.0      no
7     j      Jonas   19.0       1.0     yes

##### 38. Write a Pandas program to divide a DataFrame in a given ratio.

In [134]:
df = pd.DataFrame(np.random.normal(loc=0, scale=1, size=(10, 2)))
df70 = df.sample(frac=.7, random_state=10)
df30 = df.drop(df70.index)

print('70% of the said DataFrame:')
print(df70)

print('30% of the said DataFrame:')
print(df30)

70% of the said DataFrame:
          0         1
8 -0.528432 -1.073942
2 -0.104469  0.894319
5  0.975029  1.075040
6 -0.713269  0.289192
3  0.346304 -0.117826
1  0.162555 -0.504779
0 -1.843130  0.731842
30% of the said DataFrame:
          0         1
4 -0.871660 -0.370560
7  1.465740  0.890835
9  0.045361  0.193408

##### 39. Write a Pandas program to combining two series into a DataFrame.

In [139]:
sr1 = pd.Series([100, 200, 'python', 300.12, 400])
sr2 = pd.Series([10, 20, 'php', 30.12, 40])

print(sr1)
print(sr2)

print('New DataFrame combining two series:')
pd.concat([sr1, sr2], axis=1)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0       10
1       20
2      php
3    30.12
4       40
dtype: object
New DataFrame combining two series:

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

##### 40. Write a Pandas program to shuffle a given DataFrame rows.

In [151]:
print(df.loc[np.random.permutation(df.index)])

print(df.sample(frac=1))

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin    8.0       2.0      no
f    Michael   20.0       3.0     yes
b       Dima    9.0       3.0      no
j      Jonas   19.0       1.0     yes
c  Katherine   16.5       2.0     yes
g    Matthew   14.5       1.0     yes
e      Emily    9.0       2.0      no
d      James    NaN       NaN      no
        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
g    Matthew   14.5       1.0     yes
i      Kevin    8.0       2.0      no
f    Michael   20.0       3.0     yes
d      James    NaN       NaN      no
b       Dima    9.0       3.0      no
h      Laura    NaN       1.0      no
e      Emily    9.0       2.0      no
j      Jonas   19.0       1.0     yes
c  Katherine   16.5       2.0     yes

In [156]:
def solution_1():
    df.loc[np.random.permutation(df.index)]

def solution_2():
    df.sample(frac=1)

test_solutions(solution_1, solution_2)

Solution 1 Time: 0.039865 seconds
Solution 2 Time: 0.016993 seconds

##### 41. Write a Pandas program to convert DataFrame column type from string to datetime.

In [171]:
df = pd.DataFrame(['3/11/2000', '3/12/2000', '3/13/2000'])

print(df)

df[0] = pd.to_datetime(df[0])
print(df)

           0
0  3/11/2000
1  3/12/2000
2  3/13/2000
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

In [172]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
print("String Date:")
print(s)

r = pd.to_datetime(pd.Series(s))
df = pd.DataFrame(r)
print("Original DataFrame (string to datetime):")
print(df)

String Date:
0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object
Original DataFrame (string to datetime):
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

##### 42. Write a Pandas program to rename a specific column name in a given DataFrame.

In [177]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

df.rename(columns={'col2': 'column2'})

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col1  column2  col3
0     1        4     7
1     4        5     8
2     3        6     9
3     4        7     0
4     5        8     1

##### 43. Write a Pandas program to get a list of a specified column of a DataFrame.

In [179]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

df['col2'].to_list()

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

[4, 5, 6, 7, 8]

##### 44. Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.

In [182]:
df = pd.DataFrame(np.arange(10), index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], columns=['number'])
df

   number
a       0
b       1
c       2
d       3
e       4
f       5
g       6
h       7
i       8
j       9

In [189]:
dtype = [('Column1','int32'), ('Column2','float32'), ('Column3','float32')]
values = np.zeros(15, dtype=dtype)
index = ['Index'+str(i) for i in range(1, len(values)+1)]
df = pd.DataFrame(values, index=index)
print(df)
values

         Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

array([(0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.),
       (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.),
       (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.)],
      dtype=[('Column1', '<i4'), ('Column2', '<f4'), ('Column3', '<f4')])

##### 45. Write a Pandas program to find the row for where the value of a given column is maximum.

In [198]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

max_sr = df.idxmax()
print('Row where col1 has maximum value:')
print(max_sr.loc['col1'])

print('Row where col2 has maximum value:')
print(max_sr.loc['col2'])

print('Row where col3 has maximum value:')
print(max_sr.loc['col3'])

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Row where col1 has maximum value:
4
Row where col2 has maximum value:
4
Row where col3 has maximum value:
2
Row where col1 has maximum value:
4
Row where col2 has maximum value:
4
Row where col3 has maximum value:
2

In [204]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

print("Row where col1 has maximum value:")
print(df['col1'].argmax())

print("Row where col2 has maximum value:")
print(df['col2'].argmax())

print("Row where col3 has maximum value:")
print(df['col3'].argmax())

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Row where col1 has maximum value:
4
Row where col2 has maximum value:
4
Row where col3 has maximum value:
2

##### 46. Write a Pandas program to check whether a given column is present in a DataFrame or not.

In [210]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

def check_col(col):
    return f'{col} is{' not' if not col in df.columns else ' '} present in DataFrame'

print(check_col('col4'))
print(check_col('col1'))

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

col4 is not present in DataFrame
col1 is  present in DataFrame

##### 47. Write a Pandas program to get the specified row value of a given DataFrame.

In [217]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

print('Value of Row 1:')
print(df.iloc[0])
print()

print('Value of Row 4:')
print(df.iloc[3])

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Value of Row 1:
col1    1
col2    4
col3    7
Name: 0, dtype: int64

Value of Row 4:
col1    4
col2    7
col3    0
Name: 3, dtype: int64

##### 48. Write a Pandas program to get the datatypes of columns of a DataFrame.

In [222]:
print('Data types of the columns of the said DataFrame:')
df.dtypes

Data types of the columns of the said DataFrame:

name         object
score       float64
attempts      int64
qualify      object
dtype: object

##### 49. Write a Pandas program to append data to an empty DataFrame.

In [227]:
df = pd.DataFrame()
print('Original DataFrame:')
print(df)

print('After appending some data:')
print(pd.concat([df, pd.DataFrame({'col1': [0, 1, 2], 'col2': [0, 1, 2]})]))

Original DataFrame:
<bound method DataFrame.to_string of Empty DataFrame
Columns: []
Index: []>
After appending some data:
   col1  col2
0     0     0
1     1     1
2     2     2

##### 50. Write a Pandas program to sort a given DataFrame by two or more columns.

In [2]:
df.sort_values(['attempts', 'score'], ascending=[True, True])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
j      Jonas   19.0         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
e      Emily    9.0         2      no
c  Katherine   16.5         2     yes
b       Dima    9.0         3      no
f    Michael   20.0         3     yes
d      James    NaN         3      no

##### 51. Write a Pandas program to convert the datatype of a given column (floats to ints).

In [261]:
df['score'] = df['score'].fillna(0).astype(int)
df

        name  score  attempts qualify
a  Anastasia     12         1     yes
b       Dima      9         3      no
c  Katherine     16         2     yes
d      James      0         3      no
e      Emily      9         2      no
f    Michael     20         3     yes
g    Matthew     14         1     yes
h      Laura      0         1      no
i      Kevin      8         2      no
j      Jonas     19         1     yes

##### 52. Write a Pandas program to remove infinite values from a given DataFrame.

In [266]:
df = pd.DataFrame([1000., 2000., 3000., -4000., np.inf, -np.inf])
df.replace([np.inf, -np.inf], np.nan, inplace=True)
df

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

##### 53. Write a Pandas program to insert a given column at a specific column index in a DataFrame.

In [272]:
df = pd.DataFrame({'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

df.insert(0, column='col1', value=[1,4,3,4,5])
print(df)

   col2  col3
0     4     7
1     5     8
2     6     9
3     7     0
4     8     1

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

##### 54. Write a Pandas program to convert a given list of lists into a Dataframe.

In [273]:
l = [[2,4],[1,3]]
df = pd.DataFrame(l, columns=['col1', 'col2'])
df

   col1  col2
0     2     4
1     1     3

##### 55. Write a Pandas program to group by the first column and get second column as lists in rows.

In [283]:
df = pd.DataFrame({'col1': ['C1', 'C1', 'C2', 'C2', 'C2', 'C3', 'C2'], 'col2': [1, 2, 3, 3, 4, 6, 5]})
print(df.groupby('col1')['col2'].agg(list))
print()

print(df.groupby('col1')['col2'].apply(list))

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

##### 56. Write a Pandas program to get column index from column name of a given DataFrame

In [8]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

print('Index of "col2":')
df.columns.get_loc('col2')

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Index of "col2":

1

##### 57. Write a Pandas program to count number of columns of a DataFrame.

In [9]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

print('Number of columns:')
len(df.columns)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Number of columns:

3

##### 58. Write a Pandas program to select all columns, except one given column in a DataFrame.

In [18]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

print('All columns except "col3":')
result = df[df.columns.drop('col3')]
print(result)

print('All columns except "col3":')
result = df.loc[:, df.columns != 'col3']
print(result)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

All columns except "col3":
   col1  col2
0     1     4
1     4     5
2     3     6
3     4     7
4     5     8
All columns except "col3":
   col1  col2
0     1     4
1     4     5
3     4     7
4     5     8

In [22]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

def solution_1():
    return df[df.columns.drop('col3')]

def solution_2():
    return df.loc[:, df.columns != 'col3']

test_solutions(solution_1, solution_2)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Solution 1 Time: 0.058644 seconds
Solution 2 Time: 0.021975 seconds

##### 59. Write a Pandas program to get first n records of a DataFrame.

In [27]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

print('First 3 rows of the said DataFrame:')
print(df.iloc[0:3])

print('First 3 rows of the said DataFrame:')
print(df.head(3))

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

First 3 rows of the said DataFrame:
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
First 3 rows of the said DataFrame:
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9

##### 60. Write a Pandas program to get last n records of a DataFrame.

In [33]:
df = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
print(df)
print()

print('First 3 rows of the said DataFrame:')
print(df.iloc[-3:])

print('First 3 rows of the said DataFrame:')
print(df.tail(3))

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

First 3 rows of the said DataFrame:
   col1  col2  col3
2     3     6     9
3     4     7     0
4     5     8     1
First 3 rows of the said DataFrame:
   col1  col2  col3
2     3     6     9
3     4     7     0
4     5     8     1

##### 61. Write a Pandas program to get topmost n records within each group of a DataFrame.

In [47]:
df = pd.DataFrame({'col1': [1,2,3,4,7,11], 'col2': [4,5,6,9,5,0], 'col3': [7,5,8,12,1,11]})
print(df)
print()


print('topmost n records within each group of a DataFrame:')
print(df.sort_values('col1', ascending=False).head(3))
print(df.sort_values('col2', ascending=False).head(3))
print(df.sort_values('col3', ascending=False).head(3))
print()

print('topmost n records within each group of a DataFrame:')
print(df.nlargest(3, 'col1', keep='all'))
print(df.nlargest(3, 'col2', keep='all'))
print(df.nlargest(3, 'col3', keep='all'))

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

topmost n records within each group of a DataFrame:
   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12
   col1  col2  col3
3     4     9    12
2     3     6     8
4     7     5     1
   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

topmost n records within each group of a DataFrame:
   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12
   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5
4     7     5     1
   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

##### 62. Write a Pandas program to remove first n rows of a given DataFrame.

In [51]:
df = pd.DataFrame({'col1': [1,2,3,4,7,11], 'col2': [4,5,6,9,5,0], 'col3': [7,5,8,12,1,11]})
print(df)
print()

print(df.drop(np.arange(3)))

print(df.iloc[3:])

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11
   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

##### 63. Write a Pandas program to remove last n rows of a given DataFrame.

In [55]:
df = pd.DataFrame({'col1': [1,2,3,4,7,11], 'col2': [4,5,6,9,5,0], 'col3': [7,5,8,12,1,11]})
print(df)
print()

print(df.iloc[:-3])

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

##### 64. Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

In [59]:
df = pd.DataFrame({'W': [68,75,86,80,66], 'X': [78,85,96,80,86], 'Y': [84,94,89,83,86], 'Z': [86,97,96,72,83]})
print('origin DataFrame:')
print(df)

print('DataFrame with prefix:')
print(df.add_prefix('A_'))

print('DataFrame with suffix:')
print(df.add_suffix('_1'))

origin DataFrame:
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83
DataFrame with prefix:
   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83
DataFrame with suffix:
   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

##### 65. Write a Pandas program to reverse order (rows, columns) of a given DataFrame.

In [72]:
df = pd.DataFrame({'W': [68,75,86,80,66], 'X': [78,85,96,80,86], 'Y': [84,94,89,83,86], 'Z': [86,97,96,72,83]})
print('origin DataFrame:')
print(df)

print('Reversed columns:')
print(df.loc[:, ::-1])

print('Reversed rows:')
print(df.loc[::-1])

print('Reversed rows and reset index:')
print(df.loc[::-1].reset_index(drop=True))

origin DataFrame:
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83
Reversed columns:
    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66
Reversed rows:
    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86
Reversed rows and reset index:
    W   X   Y   Z
0  66  86  86  83
1  80  80  83  72
2  86  96  89  96
3  75  85  94  97
4  68  78  84  86

##### 66. Write a Pandas program to select columns by data type of a given DataFrame.

In [17]:
df = pd.DataFrame({
    'name': ['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22.0, 23.0]
})

print('Select numerical columns:')
print(df.select_dtypes(include=np.number))

print('Select string columns:')
print(df.select_dtypes(include='object'))

Select numerical columns:
    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0
Select string columns:
             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

##### 67. Write a Pandas program to split a given DataFrame into two random subsets.

In [31]:
df = pd.DataFrame({
    'name': ['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22.0, 23.0]
})

print("Original Dataframe and shape:")
print(df)
print(df.shape)

df1 = df.sample(frac=.6)
print("\nSubset-1 and shape:")
print(df1)
print(df1.shape)

df2 = df.drop(df1.index)
print("\nSubset-2 and shape:")
print(df2)
print(df2.shape)

Original Dataframe and shape:
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0
(5, 3)

Subset-1 and shape:
             name date_of_birth   age
4    Syed Wharton    15/09/1997  23.0
3    Eesha Hinton    11/05/2002  22.0
0  Alberto Franco    17/05/2002  18.5
(3, 3)

Subset-2 and shape:
           name date_of_birth   age
1  Gino Mcneill    16/02/1999  21.2
2   Ryan Parkes    25/09/1998  22.5
(2, 3)

##### 68. Write a Pandas program to rename all columns with the same pattern of a given DataFrame

In [46]:
df = pd.DataFrame({
    'Name': ['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth': ['17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22.0, 23.0]
})

print("Original Dataframe and shape:")
print(df)
print(df.shape)

print(df.rename(columns=str.rstrip).rename(columns=str.lower))

Original Dataframe and shape:
             Name Date_Of_Birth   Age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0
(5, 3)
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

In [45]:
df = pd.DataFrame({
    'Name': ['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth': ['17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22.0, 23.0]
})

print("Original Dataframe and shape:")
print(df)
print(df.shape)

df.columns = df.columns.str.lower().str.rstrip()
print(df)

Original Dataframe and shape:
             Name Date_Of_Birth   Age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0
(5, 3)
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

##### 69. Write a Pandas program to merge datasets and check uniqueness.

In [58]:
df = pd.DataFrame({
    'Name': ['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth': ['17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22.0, 23.0]
})
df1 = df.sample(frac=.6)
df2 = df.sample(frac=.8)

print('Original DataFrame:')
print(df)

print()
print('New DataFrame 1:')
print(df1)

print()
print('New DataFrame 2:')
print(df2)

print()
print('"one_to_one: check if merge keys are unique in both left and right datasets:"')
df_one_to_one = pd.merge(df1, df2, validate = "one_to_one")
print(df_one_to_one)

print()
print('"one_to_many: check if merge keys are unique in left dataset:')
df_one_to_many = pd.merge(df1, df2, validate = "one_to_many")
print(df_one_to_many)

print()
print('many_to_one: check if merge keys are unique in right dataset:')
df_many_to_one = pd.merge(df1, df2, validate = "many_to_one")
print(df_many_to_one)

Original DataFrame:
             Name Date_Of_Birth   Age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

New DataFrame 1:
             Name Date_Of_Birth   Age
1    Gino Mcneill    16/02/1999  21.2
0  Alberto Franco    17/05/2002  18.5
3    Eesha Hinton    11/05/2002  22.0

New DataFrame 2:
             Name Date_Of_Birth   Age
4    Syed Wharton    15/09/1997  23.0
3    Eesha Hinton    11/05/2002  22.0
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2

"one_to_one: check if merge keys are unique in both left and right datasets:"
             Name Date_Of_Birth   Age
0    Gino Mcneill    16/02/1999  21.2
1  Alberto Franco    17/05/2002  18.5
2    Eesha Hinton    11/05/2002  22.0

"one_to_many: check if merge keys are unique in left dataset:
             Name Date_Of_Birth   Age
0    Gino Mcneill    16/02/1999  21.2
1  Alberto Franco    17/05/2002  18.5
2    Eesha Hinton    11/05/2002  22.0

many_to_one: check if merge keys are unique in right dataset:
             Name Date_Of_Birth   Age
0    Gino Mcneill    16/02/1999  21.2
1  Alberto Franco    17/05/2002  18.5
2    Eesha Hinton    11/05/2002  22.0

##### 70. Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical.

In [16]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'James Brown'],
    'Age': [18, 22, 40, 50, 80, 5]
})

df["Age group"] = pd.cut(df['Age'], [0, 18, 60, np.inf], labels=['kids', 'adult', 'elderly'])

print(df['Age group'])

0       kids
1      adult
2      adult
3      adult
4    elderly
5       kids
Name: Age group, dtype: category
Categories (3, object): ['kids' < 'adult' < 'elderly']

##### 71. Write a Pandas program to display memory usage of a given DataFrame and every column of the DataFrame.

In [24]:
df = pd.DataFrame({
    'Name': ['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth': ['17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22.0, 23.0]
})


print(df.info())
print()

print(df.info(memory_usage = "deep"))
print()

print(df.memory_usage())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           5 non-null      object
 1   Date_Of_Birth  5 non-null      object
 2   Age            5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           5 non-null      object
 1   Date_Of_Birth  5 non-null      object
 2   Age            5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 773.0 bytes
None

Index            132
Name              40
Date_Of_Birth     40
Age               40
dtype: int64

##### 72. Write a Pandas program to combine many given series to create a DataFrame.

In [31]:
sr1 = pd.Series([1,2,3,4,5], name='sr1')
sr2 = pd.Series([1,2,3,4,5], name='sr2')
sr3 = pd.Series([1,2,3,4,5], name='sr3')

series = [
    pd.Series(np.random.randint(0, 100, 10), name=f'sr{i}') for i in range(1, 10)
]

pd.concat(series, axis=1)

   sr1  sr2  sr3  sr4  sr5  sr6  sr7  sr8  sr9
0   84   18   59   78   91   99   89   40   59
1   17   69   70    0   58   29    8   11   40
2    7   85   83   61   57   82   20    5   66
3   81   56   19   56    2   62   69   13    0
4    5   97   21   54   70   20   45   32   14
5   55   66   33   38   62   86   78   74   22
6   87   14   18   53   50    2   52   61   51
7   79   14   38   78   89   18   41   76   19
8   68   12   71   14   61    0   66   30    1
9   41    2   95   37    6    0   22   62   97

In [35]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])
print("Original Series:")
print(sr1)
print(sr2)

print("\nCombine above series to a dataframe:")
ser_df = pd.DataFrame(sr1, sr2).reset_index()
print(ser_df.head())
print()
print(ser_df)


print("\nUsing pandas concat:")
ser_df = pd.concat([sr1, sr2], axis = 1)
print(ser_df.head())
print()
print(ser_df)

print("\nUsing pandas DataFrame with a dictionary, gives a specific name to the columns:")
ser_df = pd.DataFrame({"col1":sr1, "col2":sr2})
print(ser_df.head(5))
print()
print(ser_df)

Original Series:
0       php
1    python
2      java
3        c#
4       c++
dtype: object
0    1
1    2
2    3
3    4
4    5
dtype: int64

Combine above series to a dataframe:
   index       0
0      1  python
1      2    java
2      3      c#
3      4     c++
4      5     NaN

   index       0
0      1  python
1      2    java
2      3      c#
3      4     c++
4      5     NaN

Using pandas concat:
        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

Using pandas DataFrame with a dictionary, gives a specific name to the columns:
     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5

     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5

##### 73. Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.

In [87]:
import string
from datetime import datetime
def rand_string():
    return ''.join(np.random.choice(list(string.ascii_uppercase + string.digits + string.ascii_lowercase), size=10))

arr = np.random.normal(size=(4, 4))
columns = ['A', 'B', 'C', 'D']
index = [rand_string() for i in range(0, 4)]

print('DataFrame: Contains random values:')
df = pd.DataFrame(arr, columns=columns, index=index)
print(df)

print()
print('DataFrame: Contains missing values:')
arr.ravel()[np.random.choice(arr.size, 10, replace=False)] = np.nan
df = pd.DataFrame(arr, columns=columns, index=index)
print(df)

DataFrame: Contains random values:
                   A         B         C         D
O3ahL681yT -0.603829 -1.204543  0.005886 -1.382626
WazBEoEIrg  1.897697 -1.226881  1.307897  0.458813
eiNwcIZW9n -0.752485 -1.731753 -0.376366  0.176219
ezC7kD8Mf7 -0.615045 -0.419137  0.259298 -0.990876

DataFrame: Contains missing values:
                   A         B         C         D
O3ahL681yT       NaN       NaN       NaN -1.382626
WazBEoEIrg       NaN       NaN       NaN       NaN
eiNwcIZW9n -0.752485 -1.731753 -0.376366  0.176219
ezC7kD8Mf7       NaN       NaN  0.259298       NaN

In [86]:
print("DataFrame: Contains random values:")
df1 = pd._testing.makeDataFrame() # contains random values
print(df1)
print("\nDataFrame: Contains missing values:")
df2 = pd._testing.makeMissingDataframe() # contains missing values
print(df2)
print("\nDataFrame: Contains datetime values:")
df3 = pd._testing.makeTimeDataFrame() # contains datetime values
print(df3)
print("\nDataFrame: Contains mixed values:")
df4 = pd._testing.makeMixedDataFrame() # contains mixed values
print(df4)

DataFrame: Contains random values:

AttributeError: module 'pandas._testing' has no attribute 'makeDataFrame'

##### 74. Write a Pandas program to fill missing values in time series data.

In [94]:
from datetime import datetime

df = pd.DataFrame(
    {
        'c1': [120., 130., 140., 150., np.nan, 170.],
        'c2': [7., np.nan, 10., np.nan, 5.5, 16.5]
    },
    index=[
        datetime(2000, 1, 3),
        datetime(2000, 1, 4),
        datetime(2000, 1, 5),
        datetime(2000, 1, 6),
        datetime(2000, 1, 7),
        datetime(2000, 1, 10),
    ]
)

df.interpolate()

               c1     c2
2000-01-03  120.0   7.00
2000-01-04  130.0   8.50
2000-01-05  140.0  10.00
2000-01-06  150.0   7.75
2000-01-07  160.0   5.50
2000-01-10  170.0  16.50

##### 75. Write a Pandas program to use a local variable within a query.

In [98]:
df = pd.DataFrame({'W': [68,75,86,80,66], 'X': [78,85,96,80,86], 'Y': [84,94,89,83,86], 'Z': [86,97,96,72,83]})
print('origin DataFrame:')
print(df)
max_w = df['W'].max()
df.query('W < @max_w')

origin DataFrame:
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
3  80  80  83  72
4  66  86  86  83

##### 76. Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression.

In [15]:
df = pd.DataFrame({
    "agent": ["a001", "a002", "a003", "a003", "a004"], 
    "purchase":["4500.00", "7500.00", "$3000.25", "$1250.35", "9000.00"]
})
df['purchase'] = df['purchase'].str.extract(r'(\d+\.?\d+)').astype(float)
df

  agent  purchase
0  a001   4500.00
1  a002   7500.00
2  a003   3000.25
3  a003   1250.35
4  a004   9000.00

In [18]:
d = {
    "agent": ["a001", "a002", "a003", "a003", "a004"], 
    "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]
}
df = pd.DataFrame(d)

print("Original dataframe:")
print(df)

print("\nData Types:")
print(df["purchase"].apply(type))

df["purchase"] = df["purchase"].replace("[$,]", "", regex = True).astype("float")
print("\nNew Data Types:")
print(df["purchase"].apply(type))
print(df)

Original dataframe:
  agent  purchase
0  a001    4500.0
1  a002    7500.0
2  a003  $3000.25
3  a003  $1250.35
4  a004   9000.00

Data Types:
0    <class 'float'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
Name: purchase, dtype: object

New Data Types:
0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
4    <class 'float'>
Name: purchase, dtype: object
  agent  purchase
0  a001   4500.00
1  a002   7500.00
2  a003   3000.25
3  a003   1250.35
4  a004   9000.00

##### 77. Write a Pandas program to get the numeric representation of an array by identifying distinct values of a given column of a dataframe.

In [19]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)

label1, unique1 = pd.factorize(df['Name'])
print("\nNumeric representation of an array by identifying distinct values:")
print(label1)
print(unique1)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Gino Mcneill     15/09/1997  23.0

Numeric representation of an array by identifying distinct values:
[0 1 2 3 1]
Index(['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton'], dtype='object')

##### 78. Write a Pandas program to replace the current value in a dataframe column based on last largest value. If the current value is less than last largest value replaces the value with 0.

In [16]:
# df = pd.DataFrame(np.random.randint(1, 100, 15))
df = pd.DataFrame([23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19])

print('Original DataFrame:')
print(df)

df[df[0] < df[0].expanding().max()] = 0

print('Replace current value in a dataframe column based on last largest value:')
print(df)

Original DataFrame:
     0
0   23
1   21
2   27
3   22
4   34
5   33
6   34
7   31
8   25
9   22
10  34
11  19
12  31
13  32
14  19
Replace current value in a dataframe column based on last largest value:
     0
0   23
1    0
2   27
3    0
4   34
5    0
6   34
7    0
8    0
9    0
10  34
11   0
12   0
13   0
14   0

In [14]:
df = pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})

print("Original DataFrame:")
print(df)

print()
print(df.rnum.cummax())

print()
print(df.rnum.eq(df.rnum.cummax()))

df['rnum']=df.rnum.where(df.rnum.eq(df.rnum.cummax()),0)

print("\nReplace current value in a dataframe column based on last largest value:")
print(df)

Original DataFrame:
    rnum
0     23
1     21
2     27
3     22
4     34
5     33
6     34
7     31
8     25
9     22
10    34
11    19
12    31
13    32
14    19

0     23
1     23
2     27
3     27
4     34
5     34
6     34
7     34
8     34
9     34
10    34
11    34
12    34
13    34
14    34
Name: rnum, dtype: int64

0      True
1     False
2      True
3     False
4      True
5     False
6      True
7     False
8     False
9     False
10     True
11    False
12    False
13    False
14    False
Name: rnum, dtype: bool

Replace current value in a dataframe column based on last largest value:
    rnum
0     23
1      0
2     27
3      0
4     34
5      0
6     34
7      0
8      0
9      0
10    34
11     0
12     0
13     0
14     0

##### 79. Write a Pandas program to create a DataFrame from the clipboard (data from an Excel spreadsheet or a Google Sheet).

In [103]:
df = pd.read_clipboard()
df

   1  2  3  4  5
0  2  2  2  2  2
1  3  3  3  3  3
2  4  4  4  4  4
3  5  5  5  5  5

##### 80. Write a Pandas program to check for inequality of two given DataFrames.

In [106]:
df1 = pd.DataFrame({'W': [68.,75.,86.,80,66], 'X': [78,85,96,80,86], 'Y': [84,94,89,83,86], 'Z': [86,97,96,72,83]})
df2 = pd.DataFrame({'W': [68,75,86,80,66], 'X': [78,85,np.nan,80,86], 'Y': [84,94,89,83,86], 'Z': [86,97,96,72,83]})
print(df1 != df2)
print(df1.ne(df2))

       W      X      Y      Z
0  False  False  False  False
1  False  False  False  False
2  False   True  False  False
3  False  False  False  False
4  False  False  False  False
       W      X      Y      Z
0  False  False  False  False
1  False  False  False  False
2  False   True  False  False
3  False  False  False  False
4  False  False  False  False

##### 81. Write a Pandas program to get lowest n records within each group of a given DataFrame.

In [21]:
df = pd.DataFrame({
    'col1': [1,2,3,4,7,11],
    'col2': [4,5,6,9,5,0],
    'col3': [7,5,8,12,1,11]
})

print('Lowest n records within each group of a DataFrame:')
print(df.nsmallest(3, columns='col1'))

print()
print(df.nsmallest(3, columns='col2'))

print()
print(df.nsmallest(3, columns='col3'))

Lowest n records within each group of a DataFrame:
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

   col1  col2  col3
5    11     0    11
0     1     4     7
1     2     5     5

   col1  col2  col3
4     7     5     1
1     2     5     5
0     1     4     7